ConnectTest/src/Enums/КаналыИнформирования/КаналыИнформирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КаналыИнформирования</name>
  <enumValues>
    <name>pushEmployee</name>
  </enumValues>
  <enumValues>
    <name>pushCustomer</name>
  </enumValues>
  <enumValues>
    <name>sms</name>
  </enumValues>
  <enumValues>
    <name>email</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/Сообщения/Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщения</name>
  <attributes>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef.ВидыПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клуб</name>
    <type>
      <types>CatalogRef.Клубы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектИД</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТип</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Определяется если пользователь зарегистирован в МП</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>CatalogRef.Токены</types>
    </type>
  </attributes>
  <attributes>
    <name>Холдинг</name>
    <type>
      <types>CatalogRef.Холдинги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПриоритетыКаналовИнформирования</name>
    <attributes>
      <name>Канал</name>
      <type>
        <types>EnumRef.КаналыИнформирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/CommonModules/РегламентныеЗаданияСервер/Module.bsl
Процедура ОтправитьСмс() Экспорт
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.sms);
КонецПроцедуры

Процедура ОтправитьPush() Экспорт
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.pushEmployee);
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.pushCustomer);
КонецПроцедуры

Процедура ПроверитьСтатусСмс() Экспорт
		
	УзелСообщенияПроверкаСтатуса	= ОбщегоНазначенияПовторноеИспользование.УзелСообщенияПроверкаСтатуса(Перечисления.КаналыИнформирования.sms); 
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             	  |	СообщенияИзменения.Ссылка.Холдинг КАК Холдинг
	             	  |ИЗ
	             	  |	Справочник.Сообщения.Изменения КАК СообщенияИзменения
	             	  |ГДЕ
	             	  |	СообщенияИзменения.Узел = &Узел";
	
	пЗапрос.УстановитьПараметр("Узел", УзелСообщенияПроверкаСтатуса);
	
	Выборка	= пЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РаботаССообщениями.ПроверитьСтатусСмсПоХолдингу(УзелСообщенияПроверкаСтатуса, Выборка.Холдинг);
	КонецЦикла;	
	
КонецПроцедуры 

Процедура РассчитатьПоказатели() Экспорт	
	Служебный.РассчитатьПоказатели();
КонецПроцедуры

Процедура ОповеститьИсточникИнформации() Экспорт
	Служебный.ОповеститьИсточникИнформации();
КонецПроцедуры

Процедура ПроверитьАктуальностьТокенов() Экспорт
	Служебный.ПроверитьАктуальностьТокенов();
КонецПроцедуры
